app/Filters/RoleAuth.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        // Check if user is authenticated
        if (!session()->get('isAuthenticated')) {
            session()->setFlashdata('error', 'Authentication required to access this area.');
            return redirect()->to('/login');
        }

        // Check if user account is still active
        $userId = session()->get('userId');
        if ($userId) {
            $userModel = new \App\Models\UserModel();
            $userRecord = $userModel->find($userId);