app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    public function login()
    {
        // If already logged in, redirect to appropriate dashboard
        if (session()->get('isAuthenticated')) {
            $role = session()->get('userRole');
            switch ($role) {
                case 'admin':
                    return redirect()->to('/manage-users');
                case 'teacher':
                    return redirect()->to('/teacher/manage-students');
                case 'student':
                    return redirect()->to('/dashboard');
                default:
                    return redirect()->to('/dashboard');
            }
        }

        // Handle POST (form submit)
        if ($this->request->getMethod() === 'POST') {
            $userEmail = $this->request->getPost('email');
            $userPassword = $this->request->getPost('password');

            if (empty($userEmail) || empty($userPassword)) {
                return redirect()->back()->with('login_error', 'Please provide both email and password.');
            }

            $userModel = new UserModel();
            $userRecord = $userModel->where('email', $userEmail)->first();

SELECT `enrollments`.*, `courses`.`title` as `course_name`, `courses`.`course_code`
FROM `enrollments`
LEFT JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '14'
ORDER BY `enrollments`.`enrolled_at` DESC
 LIMIT 3
---
                }

                // Get recent activity (enrollments)
                $data['recentActivity'] = $enrollmentModel->select('enrollments.*, courses.title as course_name, courses.course_code')
                    ->join('courses', 'courses.id = enrollments.course_id', 'left')
                    ->where('enrollments.user_id', $userId)
                    ->orderBy('enrollments.enrolled_at', 'DESC')
                    ->limit(3)
                    ->findAll();