app/Controllers/Course.php

SELECT `courses`.*, `users`.`name` as `teacher_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
ORDER BY `courses`.`created_at` DESC
SELECT `course_id`
FROM `enrollments`
WHERE `user_id` = '30'
SELECT `courses`.*, `users`.`name` as `teacher_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
WHERE `courses`.`id` NOT IN ('10','11','12','10','11','12')
ORDER BY `courses`.`created_at` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('courses')
                    ->select('courses.*, users.name as teacher_name')
                    ->join('users', 'users.id = courses.teacher_id', 'left');

        // For students, exclude courses they're already enrolled in
        $session = session();
        if ($session->get('isAuthenticated') && $session->get('userRole') === 'student') {
            $userId = $session->get('userId');
            $enrollments = $db->table('enrollments')
                             ->select('course_id')
                             ->where('user_id', $userId)
                             ->get()
                             ->getResultArray();
            $enrolledCourseIds = array_column($enrollments, 'course_id');
            if (!empty($enrolledCourseIds)) {
                $builder->whereNotIn('courses.id', $enrolledCourseIds);
            }
        }

        $courses = $builder->orderBy('courses.created_at', 'DESC')
                           ->get()
                           ->getResultArray();