app/Controllers/Course.php

    public function getEnrolledCourses()
    {
        // Check if user is logged in
        $session = session();
        if (!$session->get('isAuthenticated')) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'You must be logged in to view enrolled courses.'
            ]);
        }

        // Get user ID from session
        $user_id = $session->get('userId');

        // Get search term
        $searchTerm = $this->request->getGet('q') ?? '';

        // Get enrolled courses
        $enrolledCourses = $this->enrollmentModel->getUserEnrollments($user_id);

        // Add teacher name to each course and filter by search term
        $db = \Config\Database::connect();
        $filteredCourses = [];
        foreach ($enrolledCourses as $course) {
            $teacher = $db->table('courses')
                         ->select('users.name')
                         ->join('users', 'users.id = courses.teacher_id')
                         ->where('courses.id', $course['course_id'])
                         ->get()
                         ->getRowArray();
---
SELECT `users`.`name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
WHERE `courses`.`id` = '2'