app/Controllers/ManageUsers.php

    public function __construct()
    {
        $this->userModel = new UserModel();
        // Get the protected admin ID (first admin user - lowest ID with admin role)
        $protectedAdmin = $this->userModel->where('role', 'admin')->orderBy('id', 'ASC')->first();
---
SELECT *
FROM `users`
WHERE `role` = 'admin'
ORDER BY `id` ASC
 LIMIT 1

    public function index()
    {
        // Verify authentication
        if (!session()->get('isAuthenticated')) {
            session()->setFlashdata('error', 'Authentication required to access this area.');
            return redirect()->to('/login');
        }

        // Verify admin role
        $userRole = session()->get('userRole');
        if ($userRole !== 'admin') {
            session()->setFlashdata('error', 'Access denied: Insufficient permissions.');
            return redirect()->to('/dashboard');
        }

        // Get all users
        $users = $this->userModel->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` ASC

    public function toggleStatus()
    {
        // Verify authentication and admin role
        if (!session()->get('isAuthenticated') || session()->get('userRole') !== 'admin') {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Access denied: Insufficient permissions.'
            ]);
        }

        if ($this->request->getMethod() !== 'POST') {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Invalid request method.'
            ]);
        }

        // Get user ID
        $userId = (int) $this->request->getPost('user_id');

        // Prevent deactivating the protected admin
        if ($userId === $this->protectedAdminId) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Cannot deactivate the protected admin account.'
            ]);
        }

        // Check if user exists
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 33

            'updated_at' => date('Y-m-d H:i:s'),
        ];

        if ($this->userModel->update($userId, $updateData)) {
---
UPDATE `users` SET `status` = 'active', `updated_at` = '2025-12-10 16:08:51'
WHERE `users`.`id` IN (33)

        }

        // Check if user exists
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 10

            'updated_at' => date('Y-m-d H:i:s'),
        ];

        if ($this->userModel->update($userId, $updateData)) {
---
UPDATE `users` SET `password` = '$2y$10$/4z2omE7wbyy8orm0gocve7iXg3iYUPsnlbZhLCe02nlkhpvZsFWW', `updated_at` = '2025-12-10 07:40:51'
WHERE `users`.`id` IN (10)