app/Controllers/Teacher.php

    public function manageStudents()
    {
        // Debug logging
        log_message('info', 'Manage Students accessed by user: ' . session()->get('userId') . ', role: ' . session()->get('userRole'));

        // Verify user authentication status
        if (!session()->get('isAuthenticated')) {
            log_message('error', 'User not authenticated for manage students');
            session()->setFlashdata('error', 'Authentication required to access this area.');
            return redirect()->to('/login');
        }

        // Check if user account is still active
        $userId = (int) session()->get('userId');
        $userModel = new \App\Models\UserModel();
        $userRecord = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 15


        // Get teacher's courses for the course selection
        $courseModel = new \App\Models\CourseModel();
        $courses = $courseModel->where('teacher_id', $userId)->findAll();
---
SELECT *
FROM `courses`
WHERE `teacher_id` = 15


        // Get enrolled students for initial display (all enrolled students for this teacher)
        $db = \Config\Database::connect();
        $enrolledStudents = $db->table('enrollments e')
            ->select('u.id, u.student_id, u.name, u.email, u.program, u.year_level, u.section, u.status, e.enrolled_at, c.title as course_name, c.id as course_id')
            ->join('users u', 'u.id = e.user_id')
            ->join('courses c', 'c.id = e.course_id')
            ->where('c.teacher_id', $userId)
            ->where('u.role', 'student')
            ->groupBy('u.id')
            ->orderBy('u.name')
            ->get()
            ->getResultArray();
---
SELECT `u`.`id`, `u`.`student_id`, `u`.`name`, `u`.`email`, `u`.`program`, `u`.`year_level`, `u`.`section`, `u`.`status`, `e`.`enrolled_at`, `c`.`title` as `course_name`, `c`.`id` as `course_id`
FROM `enrollments` `e`
JOIN `users` `u` ON `u`.`id` = `e`.`user_id`
JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
WHERE `c`.`teacher_id` = 15
AND `u`.`role` = 'student'
GROUP BY `u`.`id`
ORDER BY `u`.`name`