app/Models/CourseModel.php

    public function getCoursesByTeacher($teacherId)
    {
        return $this->where('teacher_id', $teacherId)->findAll();
---
SELECT *
FROM `courses`
WHERE `teacher_id` = '31'

    public function getTeacherCourseEnrollments($teacherId)
    {
        return $this->db->table('enrollments')
            ->select('enrollments.*, users.name as student_name, courses.title as course_name, courses.course_code')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->join('users', 'users.id = enrollments.user_id')
            ->where('courses.teacher_id', $teacherId)
            ->orderBy('enrollments.enrolled_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `enrollments`.*, `users`.`name` as `student_name`, `courses`.`title` as `course_name`, `courses`.`course_code`
FROM `courses`
LEFT JOIN `enrollments` ON `enrollments`.`course_id` = `courses`.`id`
LEFT JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `courses`.`teacher_id` = '31'
ORDER BY `enrollments`.`enrolled_at` DESC