app/Models/EnrollmentModel.php

    public function getUserEnrollments($user_id)
    {
        return $this->db->table('enrollments e')
            ->select('e.*, c.title, c.description, c.created_at as course_created_at')
            ->join('courses c', 'c.id = e.course_id', 'left')
            ->where('e.user_id', $user_id)
            ->where('e.status', 'approved') // Only show approved enrollments
            ->orderBy('e.enrolled_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `e`.*, `c`.`title`, `c`.`description`, `c`.`created_at` as `course_created_at`
FROM `enrollments` `e`
LEFT JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
WHERE `e`.`user_id` = '14'
AND `e`.`status` = 'approved'
ORDER BY `e`.`enrolled_at` DESC

    public function getAvailableCourses($user_id)
    {
        // Get enrolled course IDs
        $enrolledCourseIds = $this->where('user_id', $user_id)
                                 ->select('course_id')
                                 ->get()
                                 ->getResultArray();

        $enrolledIds = array_column($enrolledCourseIds, 'course_id');

        // Get courses not in enrolled list
        $builder = $this->db->table('courses');

        if (!empty($enrolledIds)) {
            $builder->whereNotIn('id', $enrolledIds);
        }

        return $builder->select('id, title, description, created_at')
                      ->orderBy('created_at', 'DESC')
                      ->get()
                      ->getResultArray();
---
SELECT `course_id`
FROM `enrollments`
WHERE `user_id` = '14'
SELECT `id`, `title`, `description`, `created_at`
FROM `courses`
WHERE `id` NOT IN ('20','21','22')
ORDER BY `created_at` DESC