app/Models/EnrollmentModel.php

    public function getUserEnrollments($user_id)
    {
        return $this->db->table('enrollments e')
            ->select('e.*, c.title, c.description, c.created_at as course_created_at')
            ->join('courses c', 'c.id = e.course_id', 'left')
            ->where('e.user_id', $user_id)
            ->orderBy('e.enrolled_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `e`.*, `c`.`title`, `c`.`description`, `c`.`created_at` as `course_created_at`
FROM `enrollments` `e`
LEFT JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
WHERE `e`.`user_id` = 2
ORDER BY `e`.`enrolled_at` DESC