app/Models/MaterialModel.php

    public function getMaterialsByCourse($course_id)
    {
        return $this->where('course_id', $course_id)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = '20'
ORDER BY `created_at` DESC